<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of tfenv.</string>
	<key>Identifier</key>
	<string>com.github.humanendpoint.download.tfenv</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>tfenv</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/tfutils/tfenv/tags</string>
				<key>re_pattern</key>
				<string>v\d*\.\d*\.\d*</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%match%</string>
				<key>string_to_replace</key>
				<string>v</string>
				<key>replacement_string</key>
				<string></string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/StringReplacer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/tfutils/tfenv/archive/refs/tags/v%output_string%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloaderPython</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pathname%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/downloads/tfenv-v%output_string%.zip</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
