Description: Downloads the latest version of libksba.
Identifier: com.github.humanendpoint.download.libksba
MinimumVersion: '2.3'

Input:
  NAME: libksba

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/libksba.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://gnupg.org/ftp/gcrypt/libksba/libksba-%version%.tar.bz2'

  - Processor: EndOfCheckPhase
