<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's Creative Cloud Installer for Windows.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.AdobeCreativeCloudInstaller-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CreativeCloudInstaller</string>
		<key>DOWNLOAD_URL</key>
		<string>https://ccmdls.adobe.com/AdobeProducts/KCCC/1/win32/CreativeCloudSet-Up.exe</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%</string>
				<key>overwrite</key>
				<string>false</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/FileExeVersionExtractor</string>
			<key>Arguments</key>
			<dict>
				<key>exe_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
