<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with care.</string>
	<key>Description</key>
	<string>Downloads the latest version of AJA T-Tap Pro Software for Windows and adds a version to the filename.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.AJAT-TAPSoftware-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AJA T-TAP Pro</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\/support\\\/files\\\/8319\\\/en\\/(AJA-Software-Installer_Windows_v.*?\_Release.zip)</string>
                <key>url</key>
                <string>https://www.aja.com/products/t-tap-pro#support</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.aja.com/assets/support/files/8319/en/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/AJA_Win*.exe</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>exe_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/FileExeVersionExtractor</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
