<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Cyberduck for Windows.</string>
    <key>Identifier</key>
    <string>com.github.symmtree.download.Cyberduck-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Cyberduck</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://version.cyberduck.io/windows/changelog.rss</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>exe_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/FileExeVersionExtractor</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
