<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of KNIME Analytics Installer for Windows.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.KNIMEAnalytics-Win</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://download.knime.org/analytics-platform/win/knime-latest-installer-win32.win32.x86_64.exe</string>
		<key>NAME</key>
		<string>KNIME Analytics</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/HachoirMetaDataProvider3</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
