<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Power BI On-Premise Gateway installer</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.MSOn-PremiseGateway</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft On-Premise Gateway</string>
		<key>DOWNLOAD_URL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=820925</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.exe</string>
			</dict>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/HachoirMetaDataProvider3</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.exe</string>
                <key>overwrite</key>
                <string>false</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/downloads/*.exe</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>