<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's Creative Cloud Installer for Windows.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.Spotify-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Spotify</string>
		<key>DOWNLOAD_URL</key>
		<string>https://download.scdn.co/SpotifySetup.exe</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>overwrite</key>
				<string>False</string>
			</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/HachoirMetaDataProvider3</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%pathname%</string>
				<key>metadata_key</key>
				<string>version</string>
				<key>output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
