<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most recent package of Subtitle Edit from GitHub.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.SubtitleEdit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Subtitle Edit</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>SubtitleEdit/subtitleedit</string>
				<key>include_prereleases</key>
				<string>True</string>
				<key>asset_regex</key>
				<string>SubtitleEdit-[\d.]+-Setup\.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
            </dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
			<key>Arguments</key>
			<dict>
				<key>exe_path</key>
				<string>%pathname%</string>
				<key>ignore_errors</key>
				<string>True</string>
				<key>extract_dir</key>
				<string>InstallerExtract</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
			<key>Arguments</key>
			<dict>
				<key>bes_filepath</key>
				<string>%pathname%</string>
				<key>output_var_name</key>
				<string>version</string>
				<key>bes_relevance</key>
				<string>preceding text of first "%22" of following texts of first "VALUE %22ProductVersion%22,    %22" of concatenation "" of substrings separated by "%00" of concatenation ";" of lines of file "%RECIPE_CACHE_DIR%/InstallerExtract/.rsrc/version.txt" as version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>