<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TeamViewerQS Installer for Windows.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.TeamViewerQS-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewerQS</string>
		<key>DOWNLOAD_URL</key>
		<string>https://download.teamviewer.com/download/TeamViewerQS.exe</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/SharedUtilityMethods</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/FileGetExecutable</string>
			<key>Arguments</key>
			<dict>
				<key>path_array</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jgstew.SharedProcessors/FileExeVersionExtractor</string>
		</dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
