<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Visual Studio Code for Windows x64 systemwide installer</string>
	<key>Identifier</key>
	<string>com.github.symmtree.download.VisualStudioCode-Win64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VisualStudioCode</string>
		<key>DOWNLOAD_URL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=852157</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.exe</string>
			</dict>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/HachoirMetaDataProvider3</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>