Description: Downloads the latest version of unixodbc.
Identifier: com.github.humanendpoint.download.unixodbc
MinimumVersion: '2.3'

Input:
  NAME: unixodbc

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/unixodbc.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://www.unixodbc.org/unixODBC-%version%.tar.gz'

  - Processor: EndOfCheckPhase
