Description: Downloads the current release version of kustomize and imports into Munki.
Identifier: com.github.humanendpoint.munki.kustomize
ParentRecipe: com.github.humanendpoint.sign.kustomize
MinimumVersion: 0.2.0

Input:
  NAME: kustomize
  MUNKI_REPO_SUBDIR: apps/%NAME%
  MUNKI_CATEGORY: Development
  INPUT_DESCRIPTION: |
    Customize raw, template-free YAML files for multiple purposes, leaving the original YAML untouched and usable as is.

    kustomize targets kubernetes; it understands and can patch kubernetes style API objects. It's like make, in that what it does is declared in a file, and it's like sed, in that it emits edited text.
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    developer: Kubernetes SIGs
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/kubernetes-sigs/kustomize'>kustomize GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
