Description: Downloads the current release version of gh CLI and imports into Munki.
Identifier: com.github.humanendpoint.munki.gh
ParentRecipe: com.github.humanendpoint.pkg.gh

Input:
  NAME: gh
  MUNKI_REPO_SUBDIR: apps/GitHub
  INPUT_DESCRIPTION: |
      <a target='new' href='https://cli.github.com'>gh CLI</a> is GitHub's official command line tool.<br>
      <br>
      <h5>Features</h5>
      <ul>
      <li>gh is GitHub on the command line. It brings pull requests, issues, and other GitHub concepts to the terminal next to where you are already working with git and your code.</li>
      <li>This is more actively worked on by GitHub itself, rather than hub that requires community support.</li>
      </ul>
      <br>
  pkginfo:
    catalogs:
    - testing
    description: GitHub's official command line tool
    display_name: gh CLI
    name: '%NAME%'
    unattended_install: true
    category: Development
    developer: GitHub
    uninstall_method: uninstall_script
    uninstall_script: |
      #!/usr/bin/env bash

      echo "Uninstalling hub-cli..."
      rm -f /usr/local/bin/gh

      # Remove all files starting with "gh-" in /usr/local/share/man/man1
      man_dir="/usr/local/share/man/man1"
      if [ -d "$man_dir" ]; then
          find "$man_dir" -name "gh-*" -exec rm -f {} \;
          echo "Removed hub-related man pages from $man_dir"
      fi

      pkgutil --forget com.github.gh

Process:
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
    installs_item_paths:
    - /usr/local/bin/gh

- Processor: MunkiPkginfoMerger

- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/cli/cli'>gh CLI GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
