Description: Packages the latest version of hub-cli.
Identifier: com.github.humanendpoint.pkg.hub
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.hub

Input:
  NAME: hub

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
        usr/local/bin: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/scripts"

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/hub-darwin-amd64-%version%/bin/hub'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%/usr/local/bin/hub'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/hub-darwin-amd64-%version%/share'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%/usr/local/share'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/hub-darwin-amd64-%version%/etc'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%/usr/local/etc/hub_completions'

  - Processor: FileCreator
    Arguments:
      file_path: '%RECIPE_CACHE_DIR%/scripts/postinstall'
      file_content: |
        #!/usr/bin/env bash

        assigned_user="$(stat -f %Su /dev/console)"
        echo >&2 "Installing hub shell completions..."

        # Check if the user shell is Zsh
        if dscl . -read /Users/"$assigned_user" UserShell | sed 's/UserShell: //g' | grep -q zsh; then
            echo >&2 "Zsh shell detected, installing completions..."

            # Create Zsh completions directory if it doesn't exist
            if [ ! -d /etc/.zsh/completions ]; then
                mkdir -p /etc/.zsh/completions
            fi

            cp -r /usr/local/etc/hub_completions/hub.zsh_completion /etc/.zsh/completions/_hub

            if [ ! -f /etc/zshrc ]; then
                touch /etc/zshrc
            fi

            # Append to global zshrc file
            cat <<'EOF' >> /etc/zshrc
        fpath=(/etc/.zsh/completions \$fpath)
        autoload -U compinit && compinit
        EOF
        "
        else
            echo >&2 "Zsh shell not detected, moving to bash..."

            # Only append to .bash_profile if it exists
            if [ -f /etc/bash_profile ]; then
                cat <<'EOF' >> /etc/bash_profile
        if [ -f /usr/local/etc/hub.bash_completion ]; then
            . /usr/local/etc/hub.bash_completion
        fi
        EOF
            else
                echo >&2 ".bash_profile not found, skipping bash completion installation."
            fi
        fi
      file_mode: "0755"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        id: com.github.hub
        version: '%version%'
        pkgname: '%NAME%-%version%'
        options: purge_ds_store
        scripts: scripts
