Description: Downloads the current release version of hub CLI and imports into Munki.
Identifier: com.github.humanendpoint.munki.hub-cli
ParentRecipe: com.github.humanendpoint.pkg.hub-cli

Input:
  NAME: hub-cli
  MUNKI_REPO_SUBDIR: apps/GitHub
  INPUT_DESCRIPTION: |
      <a target='new' href='https://github.com/mislav/hub'>hub CLI</a> is a command-line tool that makes git easier to use with GitHub.<br>
      <br>
      <h5>Features</h5>
      <ul>
      <li>can be used to make shell scripts that directly interact with the GitHub API</li>
      <li>can be safely aliased as git, so you can type $ git <command> in the shell and have it expanded with hub features.</li>
      <li>See more on the GitHub repo!</li>
      </ul>
      <br>
  pkginfo:
    catalogs:
    - testing
    description: The older, but still powerful, version of the terminal app to manage your GitHub repos and code
    display_name: hub CLI
    name: '%NAME%'
    unattended_install: true
    category: Development
    developer: GitHub
    uninstall_method: uninstall_script
    uninstall_script: |
      #!/usr/bin/env bash

      assigned_user="$(stat -f %Su /dev/console)"
      user_zsh_completions_dir="/Users/$assigned_user/.zsh/completions"

      echo "Uninstalling hub-cli..."

      # Define paths to remove
      paths_to_remove=(
          "/usr/local/bin/hub"
          "/usr/local/share/doc/hub-doc"
          "$user_zsh_completions_dir/_hub"
          "/usr/local/etc/hub.zsh_completion"
          "/usr/local/etc/hub.bash_completion"
          "/usr/local/share/vim/vimfiles/ftdetect/pullrequest.vim"
          "/usr/local/share/vim/vimfiles/syntax/pullrequest.vim"
      )

      # Remove the files and directories from the array
      for path in "${paths_to_remove[@]}"; do
          if [ -e "$path" ]; then
              echo "Removing $path"
              rm -rf "$path"
          fi
      done

      # Remove all files starting with "hub-" in /usr/local/share/man/man1
      man_dir="/usr/local/share/man/man1"
      if [ -d "$man_dir" ]; then
          find "$man_dir" -name "hub-*" -exec rm -f {} \;
          echo "Removed hub-related man pages from $man_dir"
      fi

      # Forget the package using pkgutil
      pkgutil --forget com.github.hub-cli

      echo "hub-cli has been successfully uninstalled."


Process:
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
    installs_item_paths:
    - /usr/local/bin/hub

- Processor: MunkiPkginfoMerger

- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/mislav/hub'>hub CLI GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
