<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of balenaEtcher and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.pkg.balenaEtcher</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>io.balena.etcher</string>
		<key>NAME</key>
		<string>balenaEtcher</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.balenaEtcher</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%pathname%/balenaEtcher.app</string>
                <key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
