<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Made with care.</string>
	<key>Description</key>
	<string>Creates a package for the universal drivers for Kyocera printers.</string>
	<key>Identifier</key>
	<string>com.github.humanendpoint.pkg.KyoceraUniversalDriver</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kyocera 5052ci Universal Drivers</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.humanendpoint.download.KyoceraUniversalDriver</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Kyocera*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
    </array>
</dict>
</plist>
