Description: Uploads the latest version of icu4c.
Identifier: com.github.humanendpoint.munki.icu4c
ParentRecipe: com.github.humanendpoint.sign.icu4c
MinimumVersion: '2.3'

Input:
  NAME: icu4c
  MUNKI_REPO_SUBDIR: apps/%NAME%
  INPUT_DESCRIPTION: |
    ICU is a mature, widely used set of C/C++ and Java libraries providing Unicode and Globalization support for software applications.

    ICU is widely portable and gives applications the same results on all platforms and between C/C++ and Java software.
  pkginfo:
    catalogs:
      - production
    category: Development
    developer: unicode
    display_name: icu4c
    unattended_install: true

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/ripeda/Lectricus'>Lectricus GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
