Description: Downloads the latest version of gettext.
Identifier: com.github.humanendpoint.download.gettext
MinimumVersion: '2.3'

Input:
  NAME: gettext

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/gettext.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://ftp.gnu.org/gnu/gettext/gettext-%version%.tar.gz'

  - Processor: EndOfCheckPhase
