Description: Imports the latest version of automake into Munki.
Identifier: com.github.humanendpoint.munki.automake
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.pkg.automake

Input:
  NAME: automake
  MUNKI_REPO_SUBDIR: 'apps/gnu'
  pkginfo:
    catalogs:
      - production
    category: Development
    description: Tool for generating GNU Standards-compliant Makefiles.
    developer: GNU Software
    display_name: '%NAME%'
    name: '%NAME%'
    requires:
    - autoconf
    unattended_install: true

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'
      installs_item_paths:
        - /usr/local/bin/automake
        - /usr/local/share/doc/automake

  - Processor: MunkiPkginfoMerger
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
