Description: Packages the latest version of automake.
Identifier: com.github.humanendpoint.pkg.automake
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.automake

Input:
  NAME: automake

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'

  - Processor: com.github.humanendpoint.processors/BuildMaker
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
      alt_configure: './configure'
      alt_make_install: 'make install DESTDIR=root'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        id: com.gnu.automake
        version: '%version%'
        pkgname: 'automake-%version%'
        pkgtype: flat
        options: purge_ds_store
