Description: Packages the latest version of libyaml.
Identifier: com.github.humanendpoint.pkg.libyaml
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.libyaml

Input:
  NAME: libyaml

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'

  - Processor: com.github.humanendpoint.processors/BuildMaker
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/yaml-%version%'
      alt_configure: './configure --disable-dependency-tracking'
      alt_make_install: 'make install DESTDIR=%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        id: com.gnu.libyaml
        version: '%version%'
        pkgname: 'libyaml-%version%'
        options: purge_ds_store
