Description: Downloads the latest version of libyaml.
Identifier: com.github.humanendpoint.download.libyaml
MinimumVersion: '2.3'

Input:
  NAME: libyaml

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/libyaml.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://github.com/yaml/libyaml/releases/download/%version%/yaml-%version%.tar.gz'

  - Processor: EndOfCheckPhase
