<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Signs a provided installer package using a signing certificate identifier.</string>
      <key>Identifier</key>
      <string>com.github.humanendpoint.sign.Colima</string>
      <key>Input</key>
      <dict>
         <key>SIGNINGCERTIFICATE</key>
         <string></string>
      </dict>
      <key>ParentRecipe</key>
      <string>com.github.humanendpoint.pkg.Colima</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>com.github.rtrouton.SharedProcessors/PkgSigner</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%pkg_path%</string>
               <key>signing_cert</key>
               <string>%SIGNINGCERTIFICATE%</string>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
