Description: Downloads the latest version of colima
Identifier: com.github.humanendpoint.download.Colima
MinimumVersion: '2.3'

Input:
  NAME: colima
  ARCH: arm64

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: abiosoft/colima
      asset_regex: colima-Darwin-%ARCH%

  - Processor: URLDownloaderPython
    Arguments:
      filename: 'colima-Darwin-arm64'

  - Processor: EndOfCheckPhase
