Description: Downloads latest version of Signiant App
Identifier: com.github.symmtree.download.Signiant
MinimumVersion: 0.2.0

Input:
  NAME: SigniantApp

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: <file>(.*)</file>
    result_output_var_name: match
    url: https://updates.signiant.com/signiant_app/signiant-app-info-mac.xml

- Processor: URLDownloader
  Arguments:
    url: https://updates.signiant.com/signiant_app/%match%

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Signiant App.app'
    requirement: anchor apple generic and identifier "com.signiant.Signiant-App" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = U6ZZ4QLU4Q)
