<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Sentry-cli binary and creates a pkg, placing the binary at /usr/local/bin/sentry-cli and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.symmtree.munki.sentry-cli</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Sentry-cli</string>
        <key>DISPLAY_NAME</key>
        <string>Sentry-cli</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>catalog_stable</string>
            </array>
            <key>description</key>
            <string>A command line utility to work with Sentry.</string>
            <key>category</key>
            <string>Applications</string>
            <key>display_name</key>
            <string>Sentry-cli</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.symmtree.download.sentry-cli</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%pathname%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/usr/local/bin/sentry-cli</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkg_dir</key>
                    <string>%RECIPE_CACHE_DIR%/downloads</string>
                    <key>id</key>
                    <string>com.sentry.sentry-cli</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/usr/local/bin/sentry-cli</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
