Description: Downloads the latest version of tilt.
Identifier: com.github.humanendpoint.download.tilt
MinimumVersion: '2.3'

Input:
  NAME: Tilt
  ARCH: arm64

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/tilt.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://github.com/tilt-dev/tilt/releases/download/v%version%/tilt.%version%.mac.%ARCH%.tar.gz'

  - Processor: EndOfCheckPhase
