Description: Imports the latest version of Tilt into Munki.
Identifier: com.github.humanendpoint.munki.tilt
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.pkg.tilt

Input:
  NAME: Tilt
  MUNKI_REPO_SUBDIR: 'apps/%NAME%'
  pkginfo:
    catalogs:
      - production
    category: Development
    description: Define your dev environment as code. For microservice apps on Kubernetes.
    developer: Tilt
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: '%RECIPE_CACHE_DIR%/%NAME%'
      installs_item_paths:
        - /usr/local/bin/tilt

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
