Description: Downloads the latest version of tilt.
Identifier: com.github.humanendpoint.pkg.libxml2
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.libxml2

Input:
  NAME: libxml2

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
        usr/local/bin: '0755'
        usr/local/include: '0755'
        usr/local/share: '0755'
        usr/local/lib: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/package'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'
      archive_format: tar

  - Processor: com.github.humanendpoint.processors/BuildMaker
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
      alt_configure: './configure --without-python --without-lzma --prefix="%RECIPE_CACHE_DIR%/root"'
      alt_make_install: 'make install DESTDIR="%RECIPE_CACHE_DIR%/root"'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/root%RECIPE_CACHE_DIR%/root'
      destination_path: '%RECIPE_CACHE_DIR%/package/usr/local'
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/package'
        chown:
        - group: staff
          path: usr
          user: root
          mode: '0755'
        - group: staff
          path: usr/local
          user: root
          mode: '0755'
        id: com.github.libxml2
        version: '%version%'
        pkgname: 'libxml2-%version%'
        pkgtype: flat
        options: purge_ds_store
