Description: Downloads the latest version of YouTube Music and imports it into Munki.
Identifier: com.github.humanendpoint.munki.YouTubeMusic
ParentRecipe: com.github.humanendpoint.pkg.YouTubeMusic
MinimumVersion: 1.0.0

Input:
  NAME: YouTube Music
  MUNKI_REPO_SUBDIR: apps/%NAME%
  INPUT_DESCRIPTION: YouTube Music Desktop App bundled with custom plugins (and built-in ad blocker / downloader)
  pkginfo:
    catalogs:
    - testing
    developer: ''
    display_name: YouTube Music
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/th-ch/youtube-music'>Youtube Music GitHub</a><br> %output_string%
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
