Description: Signs a provided installer package using a signing certificate identifier.
Identifier: com.github.humanendpoint.sign.YouTubeMusic
ParentRecipe: com.github.humanendpoint.pkg.YouTubeMusic

Input:
  SIGNINGCERTIFICATE: ''

Process:
- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: '%found_filename%'
    signing_cert: '%SIGNINGCERTIFICATE%'
