Description: Downloads the latest version of YouTube Music.
Identifier: com.github.humanendpoint.download.YouTubeMusic
MinimumVersion: 1.0.0

Input:
  NAME: YouTube Music

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.dmg$
    github_repo: th-ch/youtube-music

- Processor: com.github.catawiki.processors/URLDownloaderPython
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase
