Description: Imports the latest version of openssl into Munki.
Identifier: com.github.humanendpoint.munki.openssl
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.pkg.openssl

Input:
  NAME: openssl
  MUNKI_REPO_SUBDIR: 'apps/openssl'
  pkginfo:
    catalogs:
      - production
    category: Development
    description: The OpenSSL Project develops and maintains the OpenSSL software - a robust, commercial-grade, full-featured toolkit for general-purpose cryptography and secure communication.
      The project's technical decision making is managed by the OpenSSL Technical Committee (OTC).
    developer: OpenSSL Technical Committee
    display_name: OpenSSL
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: '%RECIPE_CACHE_DIR%/%NAME%'
      installs_item_paths:
        - /usr/local/bin/openssl

  - Processor: MunkiPkginfoMerger
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
