Description: Packages the latest version of openssl.
Identifier: com.github.humanendpoint.pkg.openssl
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.openssl

Input:
  NAME: openssl

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'

  - Processor: com.github.humanendpoint.processors/BuildMaker
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
      alt_configure: './configure --openssldir=etc/openssl'
      alt_make_install: 'make install DESTDIR=%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        id: com.openssl.openssl
        version: '%version%'
        pkgname: 'openssl-%version%'
        pkgtype: flat
        options: purge_ds_store
