Comment: Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Lectricus and imports it into Munki.
Identifier: com.github.humanendpoint.munki.Lectricus
ParentRecipe: com.github.humanendpoint.sign.Lectricus
MinimumVersion: '2.3'

Input:
  NAME: Lectricus
  MUNKI_REPO_SUBDIR: apps/%NAME%
  INPUT_DESCRIPTION: Programmatic Electron fuse detection.  Runs via commandline.
  pkginfo:
    catalogs:
    - testing
    category: Security
    description: ''
    developer: RIPEDA Consulting Corporation
    display_name: Lectricus
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/ripeda/Lectricus'>Lectricus GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: "%pkg_path%"
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
