Description: Downloads the latest version of Lectricus (GUI).
Identifier: com.github.humanendpointdownload.Lectricus(GUI)
MinimumVersion: '2.3'

Input:
  NAME: Lectricus (GUI)

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: .*\.zip$
    github_repo: ripeda/Lectricus

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.zip'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Lectricus (GUI).app'
    requirement: identifier "com.ripeda.lectricus-gui" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2U3GKQ7U8Z"

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Lectricus (GUI).app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
