Description: Downloads the latest version of mpfr.
Identifier: com.github.humanendpoint.download.mpfr
MinimumVersion: '2.3'

Input:
  NAME: mpfr

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/mpfr.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://ftp.gnu.org/gnu/mpfr/mpfr-%version%.tar.xz'

  - Processor: EndOfCheckPhase
