Description: Signs a provided installer package using a signing certificate identifier.
Identifier: com.github.humanendpoint.sign.mpfr
ParentRecipe: com.github.humanendpoint.pkg.mpfr

Input:
  SIGNINGCERTIFICATE: 'Developer ID Installer: Catawiki BV (XVNMP7V3Y4)'

Process:
- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: '%pkg_path%'
    signing_cert: '%SIGNINGCERTIFICATE%'
