<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Deezer and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.pkg.Deezer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Deezer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.symmtree.download.Deezer</string>
	<key>Process</key>
	<array>
	        <dict>
	            <key>Processor</key>
	            <string>PkgCreator</string>
	            <key>Arguments</key>
	            <dict>
	                <key>pkg_request</key>
	                <dict>
	                    <key>pkgname</key>
	                    <string>%NAME%-%version%</string>
	                    <key>pkgdir</key>
	                    <string>%RECIPE_CACHE_DIR%</string>
	                    <key>id</key>
	                    <string>com.deezer.deezer-desktop</string>
	                    <key>resources</key>
	                    <string>Resources</string>
	                    <key>options</key>
	                    <string>purge_ds_store</string>
	                    <key>chown</key>
	                    <array>
	                        <dict>
	                            <key>path</key>
	                            <string>Applications</string>
	                            <key>user</key>
	                            <string>root</string>
	                            <key>group</key>
	                            <string>admin</string>
	                        </dict>
	                    </array>
	                </dict>
	            </dict>
	        </dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/*.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
