Description: Downloads the latest version of autoconf.
Identifier: com.github.humanendpoint.download.autoconf
MinimumVersion: '2.3'

Input:
  NAME: autoconf

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/autoconf.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://ftp.gnu.org/gnu/autoconf/autoconf-%version%.tar.gz'

  - Processor: EndOfCheckPhase
