Description: Imports the latest version of the Shellcheck VSCode Extension.
Identifier: com.github.humanendpoint.munki.vsceshellcheck
ParentRecipe: com.github.humanendpoint.sign.vsceshellcheck
MinimumVersion: '2.3'

Input:
  NAME: VSCE-Shellcheck
  MUNKI_REPO_SUBDIR: apps/VSCE
  INPUT_DESCRIPTION: Integrates ShellCheck into VS Code, a linter for Shell scripts.
  pkginfo:
    catalogs:
    - testing
    category: VSCode Extensions
    description: ''
    developer: Timon Wong
    display_name: Shellcheck
    name: '%NAME%'
    unattended_install: true
    installcheck_script: |
      #!/bin/bash

      loggedInUser=$(stat -f %Su /dev/console)

      if compgen -G "/Users/$loggedInUser/.vscode/extensions/timonwong.shellcheck-*" > /dev/null; then
        echo "Shellcheck is installed."
        # Loop through matching directories
        for dir in /Users/$loggedInUser/.vscode/extensions/timonwong.shellcheck-*; do
          localVersion=$(cat "$dir/package.json" | jq -r '.version')
          desiredVersion="%version%"
          if [[ "$localVersion" == "$desiredVersion" ]]; then
            echo "Shellcheck is up-to-date."
          else
            echo "Shellcheck is not up-to-date."
          fi
        done
      else
        echo "Shellcheck is not installed."
      fi

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/vscode-shellcheck/vscode-shellcheck'>Shellcheck GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: "%pkg_path%"
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
