Description: Downloads the latest version of Lectricus and imports it into Munki.
Identifier: com.github.humanendpoint.munki.vsceterraform
ParentRecipe: com.github.humanendpoint.sign.vsceterraform
MinimumVersion: '2.3'

Input:
  NAME: VSCE-Terraform
  MUNKI_REPO_SUBDIR: apps/VSCE
  INPUT_DESCRIPTION: The HashiCorp Terraform Extension for Visual Studio Code (VS Code).
    The Terraform Language Server adds editing features for Terraform files such as syntax highlighting, IntelliSense, code navigation, code formatting, module explorer and much more!
  pkginfo:
    catalogs:
    - testing
    category: VSCode Extensions
    description: ''
    developer: HashiCorp
    display_name: Terraform VSCode Extension
    name: '%NAME%'
    unattended_install: true
    installcheck_script: |
      #!/bin/bash

      loggedInUser=$(stat -f %Su /dev/console)

      if compgen -G "/Users/$loggedInUser/.vscode/extensions/hashicorp.terraform-*" > /dev/null; then
        echo "Python Linter is installed."
        # Loop through matching directories
        for dir in /Users/$loggedInUser/.vscode/extensions/hashicorp.terraform-*; do
          localVersion=$(cat "$dir/package.json" | jq -r '.version')
          desiredVersion="%version%"
          if [[ "$localVersion" == "$desiredVersion" ]]; then
            echo "Python Linter is up-to-date."
          else
            echo "Python Linter is not up-to-date."
          fi
        done
      else
        echo "Python Linter is not installed."
      fi

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: "%release_notes%"
    string_to_replace: "\n"
    replacement_string: "<br>"

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      description: >
        %INPUT_DESCRIPTION% <br><br>Release notes:<br><a target='new' href='https://github.com/hashicorp/vscode-terraform'>VScode Terraform GitHub</a><br> %output_string%

- Processor: MunkiImporter
  Arguments:
    pkg_path: "%pkg_path%"
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
