Description: Signs a provided installer package using a signing certificate identifier.
Identifier: com.github.humanendpoint.sign.vsceyaml
ParentRecipe: com.github.humanendpoint.pkg.vsceyaml

Input:
  SIGNINGCERTIFICATE: ''

Process:
- Processor: com.github.rtrouton.SharedProcessors/PkgSigner
  Arguments:
    pkg_path: '%pkg_path%'
    signing_cert: '%SIGNINGCERTIFICATE%'
