Description: Imports the latest version of libgpg-error into Munki.
Identifier: com.github.humanendpoint.munki.libgpg-error
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.sign.libgpg-error

Input:
  NAME: libgpg-error
  MUNKI_REPO_SUBDIR: 'apps/gnu'
  pkginfo:
    catalogs:
      - production
    category: Development
    description: Common error values for all GnuPG components.
    developer: GNU Software
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'
      installs_item_paths:
        - /usr/local/bin/gpg-error

  - Processor: MunkiPkginfoMerger
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
