Description: Downloads the latest version of kubectl.
Identifier: com.github.humanendpoint.download.kubectl
MinimumVersion: '1.1'

Input:
  NAME: kubectl
  ARCH: arm64

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: v(\S+)
    result_output_var_name: version
    url: https://storage.googleapis.com/kubernetes-release/release/stable.txt

- Processor: URLDownloaderPython
  Arguments:
    url: https://storage.googleapis.com/kubernetes-release/release/v%version%/bin/darwin/%ARCH%/kubectl

- Processor: EndOfCheckPhase
