Comment: Create a package to install asdf
Identifier: com.github.humanendpoint.pkg.asdf
ParentRecipe: com.github.humanendpoint.download.asdf
MinimumVersion: '2.3'

Input:
  NAME: asdf

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
        usr/local/bin: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%'

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/%NAME%*.zip"

  - Processor: Unarchiver
    Arguments:
      archive_path: '%found_filename%'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%/usr/local/bin'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        - group: staff
          path: usr/local/bin
          user: root
        id: com.github.asdf
        version: '%version%'
        pkgname: 'asdf-%version%'
        options: purge_ds_store
