Description: Downloads the latest version of AJA Control Room and creates a package.
Identifier: com.github.humanendpoint.pkg.AJAT-TAPSoftware
ParentRecipe: com.github.humanendpoint.download.AJAT-TAPSoftware
MinimumVersion: 1.0.0

Input:
  NAME: AJA T-TAP Pro
  BUNDLE_ID: com.aja.pkg.openio

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%found_filename%'
    purge_destination: true

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/AJA_NTV2_Devices.pkg/Payload'
    purge_destination: true

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/Applications/AJA Control Room.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: FileMover
  Arguments:
    overwrite: 'false'
    source: '%found_filename%'
    target: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/%NAME%-*.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/unzip'
    - '%RECIPE_CACHE_DIR%/payload'
    - '%RECIPE_CACHE_DIR%/downloads'
