<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DuplicateFinder from GitHub.</string>
    <key>Identifier</key>
    <string>com.github.symmtree.download.DuplicateFinder</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DuplicateFinder</string>
        <key>ASSET_REGEX</key>
        <string>DuplicateFinder*.app.zip</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>%ASSET_REGEX%</string>
                <key>github_repo</key>
                <string>powerwolf543/DuplicateFinder</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/%NAME%.app</string>
                <key>requirement</key>
                <string>identifier "net.nixondesign.DuplicateFinder" and anchor apple generic and identifier "net.nixondesign.DuplicateFinder" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = RF986632CV)</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>