Description: Imports the latest version of gawk into Munki.
Identifier: com.github.humanendpoint.munki.gawk
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.sign.gawk

Input:
  NAME: gawk
  MUNKI_REPO_SUBDIR: 'apps/gnu'
  pkginfo:
    catalogs:
      - testing
    category: Development
    description: GNU awk utility.
    developer: GNU Software
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'
      installs_item_paths:
        - /usr/local/bin/gawk

  - Processor: MunkiPkginfoMerger
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
