Description: Packages the latest version of gawk.
Identifier: com.github.humanendpoint.pkg.gawk
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.gawk

Input:
  NAME: gawk

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'
      archive_format: tar_gzip

  - Processor: com.github.humanendpoint.processors/BuildMaker
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
      alt_configure: './configure --disable-debug --disable-dependency-tracking --without-libsigsegv-prefix --disable-pma'
      alt_make_install: 'make install DESTDIR=%RECIPE_CACHE_DIR%/root'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        id: com.gnu.gawk
        version: '%version%'
        pkgname: 'gawk-%version%'
        pkgtype: flat
        options: purge_ds_store
