Description: Downloads the latest version of gawk.
Identifier: com.github.humanendpoint.download.gawk
MinimumVersion: '2.3'

Input:
  NAME: gawk

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/gawk.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://ftp.gnu.org/gnu/gawk/gawk-%version%.tar.xz'

  - Processor: EndOfCheckPhase
