<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Made with care.</string>
	<key>Description</key>
	<string>Creates a package from the download of a dmg in a previous step.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.pkg.PRTGDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PRTG Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.PRTG Desktop</string>
	<key>Process</key>
	<array>        
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
    </array>
</dict>
</plist>