Description: Downloads the latest version of coreutils.
Identifier: com.github.humanendpoint.download.coreutils
MinimumVersion: '2.3'

Input:
  NAME: coreutils

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/coreutils.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://ftp.gnu.org/gnu/coreutils/coreutils-%version%.tar.xz'

  - Processor: EndOfCheckPhase
