Description: Imports the latest version of coreutils into Munki.
Identifier: com.github.humanendpoint.munki.coreutils
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.sign.coreutils

Input:
  NAME: coreutils
  MUNKI_REPO_SUBDIR: 'apps/gnu'
  pkginfo:
    catalogs:
      - production
    category: Development
    description: GNU File, Shell, and Text utilities.
    developer: GNU Software
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pkg_path%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
