Description: Downloads the latest version of gmp.
Identifier: com.github.humanendpoint.download.gmp
MinimumVersion: '2.3'

Input:
  NAME: gmp

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"stable":"([^"]+)"'
      url: https://formulae.brew.sh/api/formula/gmp.json
      result_output_var_name: version

  - Processor: URLDownloaderPython
    Arguments:
      url: 'https://ftp.gnu.org/gnu/gmp/gmp-%version%.tar.xz'

  - Processor: EndOfCheckPhase
