Description: Packages the latest version of gmp.
Identifier: com.github.humanendpoint.pkg.gmp
MinimumVersion: '2.3'
ParentRecipe: com.github.humanendpoint.download.gmp

Input:
  NAME: gmp

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'

  - Processor: Unarchiver
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%'
      archive_format: tar

  - Processor: com.github.humanendpoint.processors/BuildMaker
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%'
      alt_configure: './configure --enable-cxx --with-pic'
      alt_make_install: 'make install DESTDIR=%RECIPE_CACHE_DIR%/%NAME%-%version%/root'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%-%version%/root'
        chown:
        - group: staff
          path: usr
          user: root
        - group: staff
          path: usr/local
          user: root
        id: com.gnu.gmp
        version: '%version%'
        pkgname: 'gmp-%version%'
        pkgtype: flat
        options: purge_ds_store
