<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Made with care.</string>
	<key>Description</key>
	<string>Creates a package from the download of a dmg in a previous step.</string>
	<key>Identifier</key>
	<string>com.github.symmtree.pkg.AWSCLI2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AWSCLI</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.valdore86.download.AWSCLI</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extract</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/extract/aws*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.facebook.autopkg.shared/PackageInfoVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>package_info_path</key>
				<string>%found_filename%/PackageInfo</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/extract</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
